astb_relise/src/InformationRegisters/НастройкиПараметровОбменаСАП/НастройкиПараметровОбменаСАП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПараметровОбменаСАП</name>
  <resources>
    <name>DSTNM_Получателя</name>
    <comment>Идентификатор узла получателя (отправителя) документа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>PSIZE</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>REQUID</name>
    <comment>не используется! Номер запроса с которого начинается отбор</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыводитьИнтерактивныеСообщенияОбмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыводитьСообщенияПоВыбраннымСобытиям</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗагужатьТолькоНовыеДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>WSАдресДляППС</name>
    <comment>Адрес WEB-сервиса SAP для выгрузки документов перехода права собственности</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>WSЛогинДляППС</name>
    <comment>Логин WEB-сервиса SAP для выгрузки документов перехода права собственности</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>WSПарольДляППС</name>
    <comment>Пароль WEB-сервиса SAP для выгрузки документов перехода права собственности</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>WSАдресДляКомплектовИзППС</name>
    <comment>Адрес WEB-сервиса SAP для выгрузки комплектов из документов перехода права собственности</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>WSЛогинДляКомплектовИзППС</name>
    <comment>Логин WEB-сервиса SAP для выгрузки комплектов из документов перехода права собственности</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>WSПарольДляКомплектовИзППС</name>
    <comment>Пароль WEB-сервиса SAP для выгрузки комплектов из документов перехода права собственности</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>WSАдресОпросОчереди</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>WSАдресЗагрузкаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>WSАдресУстановкаСтатуса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>WSЛогинЗагрузкаСАП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>WSПарольЗагрузкаСАП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗагружатьПоступленияИзСАП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/InformationRegisters/НастройкиПараметровОбменаСАП/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПолучитьПроксиДляВыгрузкиППС(Организация, ОписаниеОшибки,ПроверкаПодключения = Ложь) Экспорт
	
	Прокси = Неопределено;
	
	ПараметрыСервиса = ПолучитьПараметрыСервисаДляВыгрузкиППС(Организация);
	
	Если ПараметрыСервиса = Неопределено Тогда
		ОписаниеОшибки = "Не заданы параметры подключения к сервису!";
		Если ПроверкаПодключения Тогда
			Возврат Ложь;
		Иначе
			Возврат Неопределено;
		КонецЕсли;	
	КонецЕсли;	
	
	//подключение без защищенного соединения
	ЕстьПодключение = Истина;
	Попытка
		Определение 		= Новый WSОпределения(ПараметрыСервиса.WSАдресДляППС,ПараметрыСервиса.WSЛогинДляППС,ПараметрыСервиса.WSПарольДляППС,,60);
		WSСервис 			= Определение.Сервисы[0];
		Прокси 				= Новый WSПрокси(Определение, WSСервис.URIПространстваИмен, "ZSD_SO_WEB_ORDERS_GET", "ZSD_SO_WEB_ORDERS_GET");
		Прокси.Пользователь = ПараметрыСервиса.WSЛогинДляППС;
		Прокси.Пароль 		= ПараметрыСервиса.WSПарольДляППС;
	Исключение
		ОписаниеОшибки = "Не удалось установить соединение с сервером." + ОписаниеОшибки();
		ЕстьПодключение = Ложь;
	КонецПопытки;
	
	Если НЕ ЕстьПодключение Тогда //подключение с защищенным соединением
		Попытка
			Определение 		= Новый WSОпределения(ПараметрыСервиса.WSАдресДляППС,ПараметрыСервиса.WSЛогинДляППС,ПараметрыСервиса.WSПарольДляППС,,60,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
			WSСервис 			= Определение.Сервисы[0];
			Прокси 				= Новый WSПрокси(Определение, WSСервис.URIПространстваИмен, "ZSD_SO_WEB_ORDERS_GET", "ZSD_SO_WEB_ORDERS_GET",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
			Прокси.Пользователь = ПараметрыСервиса.WSЛогинДляППС;
			Прокси.Пароль 		= ПараметрыСервиса.WSПарольДляППС;
		Исключение
			ОписаниеОшибки 	= "Не удалось установить соединение с сервером." + ОписаниеОшибки();
		КонецПопытки;
	КонецЕсли;	
	
	Если ПроверкаПодключения Тогда
		Возврат НЕ Прокси = Неопределено;
	Иначе
		Возврат Прокси;
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьПараметрыСервисаДляВыгрузкиППС(Организация) Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПараметровОбменаСАП.WSАдресДляППС КАК WSАдресДляППС,
	|	НастройкиПараметровОбменаСАП.WSЛогинДляППС КАК WSЛогинДляППС,
	|	НастройкиПараметровОбменаСАП.WSПарольДляППС КАК WSПарольДляППС
	|ИЗ
	|	РегистрСведений.НастройкиПараметровОбменаСАП КАК НастройкиПараметровОбменаСАП
	|ГДЕ
	|	НастройкиПараметровОбменаСАП.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация",Организация);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Результат.Выгрузить()[0]);
	КонецЕсли;	
	
КонецФункции

//АсТБ_Alexey_57850_********************************************************************
Функция ПолучитьПроксиДляВыгрузкиКомплектовИзППС(Организация, ОписаниеОшибки,ПроверкаПодключения = Ложь) Экспорт
	
	Прокси = Неопределено;
	
	ПараметрыСервиса = ПолучитьПараметрыСервисаДляВыгрузкиКомплектовИзППС(Организация);
	
	Если ПараметрыСервиса = Неопределено Тогда
		ОписаниеОшибки = "Не заданы параметры подключения к сервису!";
		Если ПроверкаПодключения Тогда
			Возврат Ложь;
		Иначе
			Возврат Неопределено;
		КонецЕсли;	
	КонецЕсли;	
	
	//подключение без защищенного соединения
	ЕстьПодключение = Истина;
	Попытка
		Определение 		= Новый WSОпределения(ПараметрыСервиса.WSАдресДляКомплектовИзППС,ПараметрыСервиса.WSЛогинДляКомплектовИзППС,ПараметрыСервиса.WSПарольДляКомплектовИзППС,,60);
		WSСервис 			= Определение.Сервисы[0];
		Прокси 				= Новый WSПрокси(Определение, WSСервис.URIПространстваИмен, "ZWMS_REP_SM_CM", "ZWMS_REP_SM_CM");
		Прокси.Пользователь = ПараметрыСервиса.WSЛогинДляКомплектовИзППС;
		Прокси.Пароль 		= ПараметрыСервиса.WSПарольДляКомплектовИзППС;
	Исключение
		ОписаниеОшибки = "Не удалось установить соединение с сервером." + ОписаниеОшибки();
		ЕстьПодключение = Ложь;
	КонецПопытки;
	
	Если НЕ ЕстьПодключение Тогда //подключение с защищенным соединением
		Попытка
			Определение 		= Новый WSОпределения(ПараметрыСервиса.WSАдресДляКомплектовИзППС,ПараметрыСервиса.WSЛогинДляКомплектовИзППС,ПараметрыСервиса.WSПарольДляКомплектовИзППС,,60,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
			WSСервис 			= Определение.Сервисы[0];
			Прокси 				= Новый WSПрокси(Определение, WSСервис.URIПространстваИмен, "ZWMS_REP_SM_CM", "ZWMS_REP_SM_CM",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
			Прокси.Пользователь = ПараметрыСервиса.WSЛогинДляКомплектовИзППС;
			Прокси.Пароль 		= ПараметрыСервиса.WSПарольДляКомплектовИзППС;
		Исключение
			ОписаниеОшибки 	= "Не удалось установить соединение с сервером." + ОписаниеОшибки();
		КонецПопытки;
	КонецЕсли;	
	
	Если ПроверкаПодключения Тогда
		Возврат НЕ Прокси = Неопределено;
	Иначе
		Возврат Прокси;
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьПараметрыСервисаДляВыгрузкиКомплектовИзППС(Организация) Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПараметровОбменаСАП.WSАдресДляКомплектовИзППС КАК WSАдресДляКомплектовИзППС,
	|	НастройкиПараметровОбменаСАП.WSЛогинДляКомплектовИзППС КАК WSЛогинДляКомплектовИзППС,
	|	НастройкиПараметровОбменаСАП.WSПарольДляКомплектовИзППС КАК WSПарольДляКомплектовИзППС
	|ИЗ
	|	РегистрСведений.НастройкиПараметровОбменаСАП КАК НастройкиПараметровОбменаСАП
	|ГДЕ
	|	НастройкиПараметровОбменаСАП.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация",Организация);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Результат.Выгрузить()[0]);
	КонецЕсли;	
	
КонецФункции
//АсТБ_Alexey_57850_********************************************************************

// {ЮМадатов (26.07.21): <#102611 >
Функция ПолучитьПараметрыСервисаДляЗагрузкиИзСАП(Организация) Экспорт
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПараметровОбменаСАП.ЗагужатьТолькоНовыеДокументы КАК ЗагужатьТолькоНовыеДокументы,
	|	НастройкиПараметровОбменаСАП.WSАдресОпросОчереди КАК WSАдресОпросОчереди,
	|	НастройкиПараметровОбменаСАП.WSАдресЗагрузкаДокумента КАК WSАдресЗагрузкаДокумента,
	|	НастройкиПараметровОбменаСАП.WSАдресУстановкаСтатуса КАК WSАдресУстановкаСтатуса,
	|	НастройкиПараметровОбменаСАП.WSЛогинЗагрузкаСАП КАК ЛогинСервисаСАП,
	|	НастройкиПараметровОбменаСАП.WSПарольЗагрузкаСАП КАК ПарольСервисаСАП,
	|	НастройкиПараметровОбменаСАП.ВыводитьИнтерактивныеСообщенияОбмена КАК ВыводитьИнтерактивныеСообщенияОбмена
	|ИЗ
	|	РегистрСведений.НастройкиПараметровОбменаСАП КАК НастройкиПараметровОбменаСАП
	|ГДЕ
	|	НастройкиПараметровОбменаСАП.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация",Организация);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Результат.Выгрузить()[0]);
	КонецЕсли;		
КонецФункции
// } ЮМадатов (26.07.21): <#102611 >
#КонецЕсли
